MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK02FN128VLF10/mcu.h
/****************************************************************************
**
** Copyright (C) 2025 MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** OF MERCHANTABILITY, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
** TO THE WARRANTIES FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/

#ifndef __MK02FN128VLF10_H__
#define __MK02FN128VLF10_H__



//*****************************************************************************
//
// Interrupt assignments
//
//*****************************************************************************

#define NUMBER_OF_INT_VECTORS                   483               // Number of interrupts in the Vector table
#define NotAvail_IRQn                           -47              // Not available device specific interrupt
#define NonMaskableInterrupt_IRQn               -14              // Non-maskable Interrupt (NMI)
#define HardFault_IRQn                          -13              // Hard Fault
#define MemManageFault_IRQn                     -12              // MemManage Fault
#define BusFault_IRQn                           -11              // Bus Fault
#define UsageFault_IRQn                         -10              // Usage Fault
#define SVCall_IRQn                             -5               // Supervisor call (SVCall)
#define DebugMonitor_IRQn                       -4               // Debug Monitor
#define PendSV_IRQn                             -2               // Pendable request for system service (PendableSrvReq)
#define SysTick_IRQn                            -1               // System tick timer (SysTick)
#define DMA0_IRQn                               0                // DMA channel 0 transfer complete
#define DMA1_IRQn                               1                // DMA channel 1 transfer complete
#define DMA2_IRQn                               2                // DMA channel 2 transfer complete
#define DMA3_IRQn                               3                // DMA channel 3 transfer complete
#define DMA_Error_IRQn                          16               // DMA error interrupt channels 0-3
#define FPU_SourceS_IRQn                        17               // FPU sources
#define Command_Complete_IRQn                   18               // Command complete
#define Read_Collision_IRQn                     19               // Read collision
#define PMC_IRQn                                20               // Low-voltage detect, low-voltage warning
#define LLWU_IRQn                               21               // Low Leakage Wakeup
#define Both_Watchdog_Modules_Share_This_Interrupt_IRQn 22               // Both watchdog modules share this interrupt
#define I2C0_IRQn                               24               // -
#define SPI0_IRQn                               26               // Single interrupt vector for all sources
#define UART0_RX_TX_IRQn                        31               // Single interrupt vector for UART status sources
#define UART0_ERR_IRQn                          32               // Single interrupt vector for UART error sources
#define UART1_RX_TX_IRQn                        33               // Single interrupt vector for UART status sources
#define UART1_ERR_IRQn                          34               // Single interrupt vector for UART error sources
#define ADC0_IRQn                               39               // -
#define CMP0_IRQn                               40               // -
#define CMP1_IRQn                               41               // -
#define FTM0_IRQn                               42               // Single interrupt vector for all sources
#define FTM1_IRQn                               43               // Single interrupt vector for all sources
#define FTM2_IRQn                               44               // Single interrupt vector for all sources
#define Reserved_IRQn                           46               // -
#define Reserved_IRQn                           47               // -
#define PIT0_IRQn                               48               // Channel 0
#define PIT1_IRQn                               49               // Channel 1
#define PIT2_IRQn                               50               // Channel 2
#define PIT3_IRQn                               51               // Channel 3
#define PDB_IRQn                                52               // -
#define DAC0_IRQn                               56               // -
#define MCG_IRQn                                57               // -
#define LPTMR0_IRQn                             58               // -
#define PORTA_IRQn                              59               // Pin detect (Port A)
#define PORTB_IRQn                              60               // Pin detect (Port B)
#define PORTC_IRQn                              61               // Pin detect (Port C)
#define PORTD_IRQn                              62               // Pin detect (Port D)
#define PORTE_IRQn                              63               // Pin detect (Port E)
#define Software_Interrupt4_IRQn                64               // Software interrupt4



//*****************************************************************************
//
// Port Control and Interrupts (PORT) registers
//
//*****************************************************************************

